Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དགེ་སློང་གཞན་དག་ལ་ཡང་རེ་རེ་ལ་རས་ཟུང་རེ་ཕུལ་ནས།
en: After that he also offered each of the other monks a set of robes fashioned from cotton.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་སྟེ། དགེ་བའི་རྩ་བ་འདིས་ན་བདག་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་སྟོན་པ་མེད་པར། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་། ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི། ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: Then he prayed for unexcelled, total, and complete enlightenment, saying, “By this root of virtue may I become a protector for the world’s blind who are without a guide, without anyone to show them the way—a tathāgata, an arhat, a totally and completely awakened buddha possessed of insight and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—a blessed buddha.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་དེ་ལ་བཀའ་སྩལ་པ། ཁྱེའུ་ལེགས་སོ་ལེགས་སོ། །
en: “Very good, brahmin, very good,” the Blessed One said to the young man.

source: ཁྱེའུ་ཁྱོད་མ་འོངས་པའི་དུས་ན་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་སྟོན་པ་མེད་པར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི། ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྟོབས་དང་བརྩོན་འགྲུས་ཀྱི་རྩལ་དང་ལྡན་པ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་གསུངས་སོ།། །།
en: “Brahmin, in the future you will be a protector for the world’s blind who are without a guide, without anyone to show them the way—a tathāgata, an arhat, a totally and completely awakened buddha possessed of insight and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—the blessed buddha known as Possessor of the Valor of Strength and Effort.”

source: མགོན་མེད་ཟས་སྦྱིན་ཞེས་བྱ་བ་ནི།
en: A Story about Anāthapiṇḍada

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན། བྲམ་ཟེ་དབུལ་པོ་འཚོ་བས་ཕོངས་པ་ཞིག་གནས་ཏེ། དེ་ཡང་གསོ་བ་མང་ཞིང་གཡོག་འཁོར་མང་བ་ཞིག་སྟེ།
en: When the Blessed One was in Śrāvastī, there lived a certain poor brahmin who had to provide for many and had many servants.

source: དེས་བསམས་པ་བདག་གིས་ཕྱུག་པོ་གང་ཞིག་ལ་བརྟེན་ཏེ། འཚོ་བ་བཙལ་བར་བྱ་སྙམ་མོ། །
en: He thought, “I will entrust myself to some rich person for my livelihood.”

source: དེ་ནས་དེས་བསམས་པ་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་ནི་སྙིང་རྗེ་ཅན་སྦྱིན་པ་ལ་སྲེད་པ་ཡིན་ཏེ།
en: Then he thought, “The householder Anāthapiṇḍada is compassionate, and wants so deeply to perform acts of charity.

source: དེས་ནི་བདག་ལ་དགོས་པ་ཐམས་ཅད་ཀྱིས་སྡུད་པར་ནུས་སོ་སྙམ་མོ། །
en: He will be able to collect for me the things I need.”

source: དེ་ནས་དེའི་གྲིབ་མ་དང་མི་འབྲལ་བ་བཞིན་དུ་དེའི་ཕྱིར་འབྲང་ངོ་། །
en: So he began to follow him about like a shadow, never separating from him.

source: དེ་ནས་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱིས་འཕྲིགས་ནས་དྲིས་པ།
en: The householder Anāthapiṇḍada became suspicious and asked him,

source: བྲམ་ཟེ་ཁྱོད་ང་ལ་རག་ལས་པ་ཅི་ཡོད།
en: “Brahmin, why have you attached yourself to me?”

source: བྲམ་ཟེས་སྨྲས་པ། ཁྱིམ་བདག་རག་ཅི་ཡང་ལས་ཏེ། ཁྱོད་ལ་བརྟེན་ནས་འཚོ་བ་བཙལ་བར་འདོད་དོ། །
en: “Householder, I have attached myself to you because I wish to entrust myself to you for my livelihood,” the brahmin replied.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱིས་དེའི་འཚོག་ཆས་ཐམས་ཅད་སྦྱོར་བ་ལ་ཞུགས་སོ། །
en: When he heard this, the householder Anāthapiṇḍada immediately began to provide for all his needs.

source: ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱི་ལུགས་ཀྱིས་ན། ཉིན་གཅིག་བཞིན་དུ་གཡོག་འཁོར་ལྔ་བརྒྱ་དང་། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་འགྲོ་ཞིང་ཕྱག་དར་བྱེད་དོ། །
en: It was the householder Anāthapiṇḍada’s custom to go to the garden of Prince Jeta and sweep every day with a suite of five hundred attendants.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེའི་བྱ་བ་ཞིག་བྱུང་ནས་དེས་བྲམ་ཟེ་དེ་མངགས་ཏེ། དེང་ཁྱོད་ཀྱིས་རྒྱལ་བུ་རྒྱལ་བུ་བྱེད་ཀྱི་ཚལ་དུ་ཕྱག་དར་གྱིས་ཤིག་ཅེས་བྱས་ནས། ཁྱིམ་བདག་དེ་སོང་ངོ་། །
en: The householder Anāthapiṇḍada had something to do, so he commissioned the brahmin to sweep the garden of Prince Jeta. With that the householder departed,

source: བྲམ་ཟེ་དེ་ཡང་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་གྱི་བྱི་དོར་བྱེད་པ་ལ་ཞུགས་སོ། །
en: and the brahmin began to sweep the garden of Prince Jeta.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ་བྲམ་ཟེ་འདི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་སེམས་བསྐྱེད་པར་འགྱུར་རོ་
en: Now the Blessed One thought, “This brahmin will pursue unexcelled, total, and complete enlightenment with single-minded resolve.”

source: སྙམ་དུ་དགོངས་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ནས་ཅུང་ཟད་ཙམ་ཞིག་བྱི་དོར་བྱས་པ་དེ་ཙམ་ཡང་བྱི་དོར་བྱས་པར་མི་མངོན་པ་དེ་ལྟར་བྱིན་གྱིས་བརླབས་ནས།
en: With this thought the Blessed One performed a miracle by which, however much sweeping the brahmin did, not even the tiniest results would be evident.

source: དེ་དེས་གཡེངས་ཏེ་ཉི་མ་རངས་པ་ཐལ་བར་གྱུར་ཏོ། །
en: The brahmin was distracted by his task and as a result was happy all day.

source: དེ་ནས་དེས་བསམས་པ་ད་ནི་བདག་གིས་མཉན་དུ་ཡོད་པར་མི་ཕྱིན་ཏོ་སྙམ་ནས། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དེ་ཉིད་དུ་དགོངས་མལ་བཏབ་བོ། །
en: Afterward he thought, “I should not go back to Śrāvastī now,” and that night he went to bed down in the garden of Prince Jeta.

source: ཀུན་དགའ་བོ་སོང་ལ་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་གྱི་ནང་དུ་བྲམ་ཟེ་དེའི་མལ་ཆོས་ཏེ།
en: “Ānanda, make a place for the brahmin to sleep in the garden of Prince Jeta.

source: ཁྱོད་ཀྱང་དེའི་འདབ་ཏུ་འདུག་ལ། དེས་ཁྱོད་ལ་ཅི་དྲིས་པ་དེའི་ལན་ཁྱོད་ཀྱིས་ཐོབ་ཤིག །
en: Sit with him and answer whatever questions he asks you.”

source: གཞན་ཡང་དགེ་སློང་རྣམས་ལ་བསྒོ་བ། དགེ་སློང་དག་གིས་དགེ་བ་བཅབ་པ་དང་། སྡིག་པ་བཤགས་པའི་ཚུལ་གྱིས་གནས་པར་གྱིས་ཤིག་ཅེས་ངས་བསྟན་མོད་ཀྱིས། འོན་ཀྱང་བྲམ་ཟེ་འདི་ལ་སྙིང་བརྩེ་བའི་ཕྱིར། སུས་རྫུ་འཕྲུལ་ཅི་ལྟ་བུ་ཐོབ་ཀྱང་རུང་སྟེདེས་རྫུ་འཕྲུལ་དེ་ལྟ་བུ་སྟོན་ཅིག་ཅེས་གྱིས་ཤིག །
en: And he further instructed the monks, “Monks, though I have taught that monks should live with their virtues hidden and their sins disclosed, out of compassion for this brahmin whoever has achieved some miraculous powers should display them openly.”

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་གསོལ་པ། བཙུན་པ་དེ་ལྟར་འཚལ་ལོ། །
en: Venerable Ānanda replied, “I shall, Lord.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་དགེ་སློང་རྣམས་ལ་བསྒོ་བ།
en: And Venerable Ānanda then instructed the monks,

source: རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་འདིའི་ནང་ན་བྲམ་ཟེ་འདུག་པ་དེའི་མལ་ཆོས་ལ། དེའི་འདབ་ཏུ་འཁོད་ཅིག་ཅེས་བསྒོའོ། །
en: “Make a place for the brahmin sitting in the garden of Prince Jeta to sleep, then sit with him a while.”

source: དེ་ནས་དེ་དེ་ན་འདུག་པ་ལ་དགེ་སློང་རྣམས་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་གཞན་དང་། གཞན་དག་སྟོན་པ་ལ་ཞུགས་སོ། །
en: As the brahmin sat there in the garden, different monks began to display their various miraculous powers.

source: དེ་ནས་བྲམ་ཟེ་དེས་མཐོང་ནས། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་དྲིས་པ།
en: Seeing them, the brahmin asked Venerable Ānanda,

source: བཙུན་པ་ཀུན་དགའ་བོ་འདི་ལྟར་རྫུ་འཕྲུལ་ཆེ་ཞིང་འདི་ལྟར་མཐུ་ཆེ་བ་འདི་དག་སུ་དག་ཅིག །
en: “Lord Ānanda, who are these people who have such great miracles and great power?

source: ཅི་འདྲ་བ་ཞིག་གུ་སྙམ་མོ། །
en: What kind of people are they?”

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་སྨྲས་པ། བཅོམ་ལྡན་འདས་ཀྱི་ཉན་ཐོས་རྣམས་ཡིན་ནོ། །
en: “These are the disciples of the Blessed One,” said Venerable Ānanda.

source: དེ་ནས་བྲམ་ཟེ་དེས་བསམས་པ། སློབ་མ་རྣམས་ཀྱང་འདི་ཁོ་ན་ལྟར་ཕུན་སུམ་ཚོགས་པ་དང་ལྡན་ན། དགེ་སྦྱོང་གཽ་ཏ་མ་ལྟ་ཅི་སྨོས་ཏེ། དེ་ཅི་འདྲ་བ་ཞིག་གུ་སྙམ་མོ། །
en: “If even his disciples are sublime,” the brahmin thought, “what need to speak of what the ascetic Gautama himself must be like.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇིག་རྟེན་པའི་སེམས་བསྐྱེད་དེ།
en: Then the Blessed One had a thought about the world:

source: ཀྱེ་མ་སྲོད་ལ་ནི་རྒྱལ་པོ་ཆེན་པོ་བཞི་ང་ལ་བལྟ་བའི་ཕྱིར་འོང་ན་ལེགས་སོ། །
en: “It would be good for the four great kings to come see me this evening,

source: ནམ་ཕྱེད་ན་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ང་ལ་བལྟ་བའི་ཕྱིར་འོང་ན་ལེགས་སོ། །
en: for Śakra, King of the Gods, to come see me in the middle of the night,

source: ཐོ་རངས་ན་ནི་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་ང་ལ་བལྟ་བའི་ཕྱིར་འོང་ན་ལེགས་སོ་སྙམ་དུ་དགོངས་སོ། །
en: and for Sahāṃpati Brahmā to come to see me early in the morning.”

source: དེ་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་ཐུགས་བསྐྱེད་པའི་འཕྲལ་འཕྲལ་དུ་རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་འོངས་སོ། །
en: Once the Buddha had this thought the four great kings, Śakra, King of the Gods, and Sahāṃpati Brahmā came to see the Blessed One, accordingly.

source: བཙུན་པ་ཀུན་དགའ་བོ་འདི་འདྲ་བ་འདི་དག་སུ་དག་ཅིག །
en: “Lord Ānanda, who are these beings?”

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་སྨྲས་པ། འདི་དག་ནི་རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་བཅོམ་ལྡན་འདས་ལ་བལྟ་བའི་ཕྱིར་འོངས་པ་ཡིན་ནོ། །
en: “These are the four great kings, Śakra, King of the Gods, and Sahāṃpati Brahmā, who have all come to see the Blessed One,” Venerable Ānanda replied.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་བྲམ་ཟེ་དེ་བཅོམ་ལྡན་འདས་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏེ།
en: When he heard this the brahmin experienced a surge of joy toward the Blessed One.

source: མིར་གྱུར་པ་ལ་ཡང་འདི་ལྟ་བུའི་གནས་ཐོབ་པ་ཡོད་པ་ལྟ། ཀྱེ་མ་བདག་ཀྱང་སངས་རྒྱས་སུ་གྱུར་ཏེ། འཇིག་རྟེན་དུ་འབྱུང་བར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: He thought, “If there are those who are capable of achieving such a state even as human beings, then I will also become a buddha and appear in the world!”

source: དེ་ནས་དེས་བསམས་པ་གནས་འདི་ལྟ་བུ་ནི་ཡིད་སྨོན་དུ་བྱས་པ་ཙམ་གྱིས་འགྲུབ་པར་མི་འགྱུར་གྱིས།
en: And he thought, “Such a state cannot be attained simply by wishing for it,

source: མ་ལ་བདག་གིས་སྦྱིན་པ་དག་བྱིན་ཞིང་བསོད་ནམས་དག་བྱས་ལ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་བོ་སྙམ་མོ། །
en: so I will give gifts, make merit, and pray for unexcelled, total, and complete enlightenment.”

source: ནམ་ནངས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། མཉན་དུ་ཡོད་པར་ཆས་སོ། །
en: When morning came, he touched his head to the Blessed One’s feet and departed for Śrāvastī.

source: ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་ཡང་གཡོག་འཁོར་ལྔ་བརྒྱ་དང་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་དོང་སྟེ། ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱིས་ཐག་རིང་པོ་ཞིག་ནས་བྲམ་ཟེ་དེ་མཐོང་ངོ་། །
en: The householder Anāthapiṇḍada was on his way to the garden of Prince Jeta with a company of five hundred servants when he saw the brahmin from a distance.

source: མཐོང་ནས་ཀྱང་བྲམ་དེ་ལ་སྨྲས་པ།
en: When he saw him he called to the brahmin,

source: བྲམ་ཟེ་ཁྱོད་ཀྱིས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་དེའི་བར་ངོ་མཚར་རྨད་དུ་བྱུང་བའི་ཆོས་ཅུང་ཟད་ཅིག་མཐོང་ངམ།
en: “Brahmin, did you see anything amazing or wondrous in the garden of Prince Jeta?”

source: དེ་ནས་བྲམ་ཟེ་དེས་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་ལ་ཐམས་ཅད་བསྙད་དོ། །
en: The brahmin then related everything to the householder Anāthapiṇḍada.

source: དེ་ནས་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱིས་བྲམ་ཟེ་དེ་ལ་སྨྲས་པ།
en: “Brahmin,” the householder Anāthapiṇḍada asked,

source: བྲམ་ཟེ་ཁྱོད་ཀྱིས་ངོ་མཚར་རྨད་དུ་བྱུང་བ་དེ་ལྟ་བུ་དག་མཐོང་ན། ཁྱོད་ཅི་འདོད་པར་གྱུར།
en: “what is your wish, now that you have seen such amazing and wondrous things?”

source: བྲམ་ཟེ་དེས་སྨྲས་པ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདོད་མོད་ཀྱིས། ཁྱིམ་བདག་འོན་ཀྱང་གནས་དེ་ལྟ་བུ་ནི་ཡིད་སྨོན་ཙམ་གྱིས་འགྲུབ་པར་མི་འགྱུར་བས་ན།
en: The brahmin replied, “Though I wish for unexcelled, total, and complete enlightenment, householder, I shall not attain such a state simply by wishing for it.

source: བདག་གིས་སློང་མོ་བྱས་ལ་སྦྱིན་པ་དག་སྦྱིན་ཞིང་བསོད་ནམས་དག་བྱ་བར་འདོད་དོ། །
en: Therefore, I want to give gifts to those who beg, and to make merit.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱིས། བྲམ་ཟེ་དེ་ལ་ནོར་གྱི་ཕུང་པོ་ཆེན་པོ་བྱིན་ནོ། །
en: Upon hearing this, the householder Anāthapiṇḍada immediately gave a heap of jewels to the brahmin.

source: བྲམ་ཟེ་དེས་ཀྱང་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཟླ་བ་གསུམ་དུ་སྤྱན་དྲངས་ནས། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་ཡོ་བྱད་ཐམས་ཅད་སྦྱར་ནས།
en: The brahmin extended an invitation to the Buddha and the rest of the saṅgha of monks, and for three months provided for all their needs.

source: སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཟླ་བ་གསུམ་གྱི་བར་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་ནས།
en: After he had respectfully served all the needs of the Blessed One and the rest of the saṅgha of monks for three months,

source: ཐ་མའི་ཉིན་པར་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཞལ་ཟས་རོ་བརྒྱ་དང་ལྡན་པས་ཚིམ་པར་བྱས་ནས། བཅོམ་ལྡན་འདས་ལ་ན་བཟའ་འབུམ་རི་བ་ཕུལ་ལོ། །
en: on the last day he offered the Buddha and the rest of the saṅgha of monks food of a hundred flavors and to the Blessed One he offered a very costly robe.

source: ཀྱེ་མ་དགེ་བའི་རྩ་བ་འདིས་ན། བདག་འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་སྟོན་པ་མེད་པར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་སུ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: “By this root of virtue may I become a protector for the world’s blind who are without a guide, without anyone to show them the way—a tathāgata, an arhat, a totally and completely awakened buddha possessed of insight and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—a blessed buddha.”

source: བྲམ་ཟེ་ཁྱོད་མ་འོངས་པའི་དུས་ན། འཇིག་རྟེན་ལོང་བ་འདྲེན་པ་མེད་པ་སྟོན་པ་མེད་པར། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་མྱ་ངན་མེད་ཅེས་བྱ་བར་འགྱུར་རོ་ཞེས་གསུངས་སོ།། །།
en: Brahmin, in the future you will be a protector for the world’s blind who are without a guide, without anyone to show them the way—a tathāgata, an arhat, a totally and completely awakened buddha possessed of insight and perfect conduct, a sugata, a knower of the world, a tamer of persons, a charioteer, an unsurpassed one, a teacher of humans and gods—the blessed buddha known as Aśoka .”

source: ཉམ་ཆུང་བ་ཞེས་བྱ་བ་ནི།
en: The Humble One

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་ལ་མཐར་གྱི་བུ་བདུན་བྱུང་ནས།
en: When the Blessed One was in Śrāvastī, the householder Anāthapiṇḍada had seven sons in total,

source: དེ་དག་རིགས་དང་འཐུན་པར་མིང་བཏགས་ཏེ།
en: each of them named according to their clan.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱིས་བསམས་པ།
en: One day the householder Anāthapiṇḍada thought,

source: བདག་གི་བྱིས་པ་འདི་དག་མཛའ་སྡེ་དག་གི་ནང་དུ་གཟུད་པར་བྱའོ། །
en: “I should introduce these children to a social club,

source: དེ་ཡང་དད་པ་དང་ལྡན་པ་རྣམས་ཀྱི་ནང་དུ་གཟུད་པར་བྱའི། མ་དད་པ་རྣམས་ཀྱི་ནང་དུ་ནི་གཟུད་པར་མི་བྱའོ། །
en: but I should introduce them to one that has faith, not one that has no faith.

source: གལ་ཏེ་མ་དད་པ་རྣམས་ཀྱི་ནང་དུ་བཙུད་པར་གྱུར་ན་ནི། འདི་དག་ཀྱང་དེ་དག་གི་བསྟན་པས་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་མི་ལྟ་བར་འགྱུར་སྲིད་དོ་སྙམ་ནས།
en: If I introduce them to one that has no faith, it may influence them to not believe in the Buddha’s doctrine.”

source: སངས་རྒྱས་པའི་མཛའ་སྡེའི་ནང་དུ་བཙུད་དོ། །
en: So he introduced them to a Buddhist social club.

source: དེ་ལ་མ་དད་པའི་མཛའ་སྡེ་གང་ཡིན་པ་དེ་དག་ནི་གར་ཐབས་དང་གྲོང་རྒྱུ་བ་དང་། སྨད་འཚོང་མ་རྣམས་ལ་ཆགས་ཤིང་འཁོད་དོ། །
en: The faithless went about seeking entertainment, roaming the village, and frequenting prostitutes.

source: ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱི་བུ་རྣམས་ནི། དགེ་བསྙེན་གྱི་མཛའ་སྡེ་རྣམས་དང་། སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་ལྷག་པར་བྱ་བ་བྱེད་པ་དང་། བསྙེན་གནས་དང་། ཆོས་མཉན་པ་ལ་ཆགས་ཤིང་འཁོད་དོ། །
en: But the sons of the householder Anāthapiṇḍada rendered special service to their group of lay vow holders and to the Buddha, Dharma, and Saṅgha, and occupied themselves with single-day fasting vows and listening to the Dharma.

source: མཉན་དུ་ཡོད་པ་དེ་ན་བྲམ་ཟེའི་ཁྱེའུ་དབུལ་ཞིང་འཚོ་བས་ཕོངས་པ་ཞིག་འདུག་པ་དེས་བསམས་པ་བདག་མཛའ་སྡེ་དག་གི་ནང་དུ་ཞུགས་ལ། བདག་གིས་དེ་དག་ལ་བརྟེན་ནས་འཚོ་བ་བཙལ་བར་བྱའོ་སྙམ་ནས
en: There also lived in Śrāvastī a certain young brahmin who was poor and destitute of means, and he thought, “I will join this social club and entrust myself to them for my livelihood.”

source: དགེ་བསྙེན་གྱི་མཛའ་སྡེའི་ནང་དུ་འཇུག་པར་འདོད་དེ་དྲིས་པ།
en: Wishing to join the group of lay vow holders, he asked them,

source: ནོར་གྱི་བུངས་ཅི་ཙམ་གྱིས་ན་ཁྱོད་ཀྱི་ནང་དུ་འཇུག་ཏུ་དབང་།
en: “How much money do I need to join your group?”

source: དེ་དག་གིས་སྨྲས་པ། ཀཱར་ཥཱ་པ་ཎ་ལྔ་བརྒྱས་ངེད་ཀྱི་ནང་དུ་འཇུག་ཏུ་དབང་ངོ་། །
en: “You may join us for five hundred gold coins,” they said.

source: བྲམ་ཟེའི་ཁྱེའུ་དེས་སྨྲས་པ། བདག་ལ་ཀཱར་ཥཱ་པ་ཎ་ལྔ་བརྒྱ་ལྟ་ག་ལ་ཡོད།
en: “How could I have five hundred gold coins?” said the young brahmin.

source: དེའི་སྟེང་དུ་ཁྱེད་ནི་དབང་ཕྱུག་གིས་ཆོག་པར་འདུག་ལ་སྦྱིན་པ་ལ་སྲེད་པ་ཡིན་ན། བདག་ནི་དབུལ་པོ་འཚོ་བས་ཕོངས་པ་ཞིག་ཡིན་པས་ན།
en: “Even if I wanted to give you the money you require, I am destitute of means,

source: བདག་གིས་ཁྱོད་ལ་ནོར་དེ་སྙེད་དབུལ་མི་ནུས་སོ། །
en: so I don’t have any such money to offer you.”

source: དེ་ནས་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱི་བུ་རྣམས་ཀྱིས་སྨྲས་པ།
en: The sons of the householder Anāthapiṇḍada replied,

source: གལ་ཏེ་ཁྱོད་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དད་པར་བྱེད་ན་ནི། ངེད་ཀྱིས་ཁྱོད་ལ་ཀཱར་ཥཱ་པ་ཎ་ལྔ་བརྒྱ་སྦྱིན་ནོ། །
en: “If you have faith in the doctrine of the Blessed Buddha, we’ll give you five hundred gold coins.”

source: བྲམ་ཟེའི་ཁྱེའུས་སྨྲས་པ། དགེ་སྦྱོང་གཽ་ཏ་མ་དེའི་ཡོན་ཏན་རྣམས་བདག་གིས་མི་ཤེས་ན།
en: “I know nothing of the ascetic Gautama’s great virtues,” said the young brahmin.

source: དགེ་སྦྱོང་གཽ་ཏ་མ་དེའི་ཡོན་ཏན་རྣམས་ཅི་ལྟ་བུ་ཡིན།
en: “What are the ascetic Gautama’s great virtues?”

source: དེ་ནས་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱི་བུ་རྣམས་ཀྱིས་བྲམ་ཟེའི་ཁྱེའུ་དེ་ལ་སངས་རྒྱས་ཀྱི་བསྔགས་པ་བརྗོད་དོ། །
en: The sons of householder Anāthapiṇḍada then extolled the virtues of the Buddha to the young brahmin,

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་བྲམ་ཟེའི་ཁྱེའུ་དེ། སངས་རྒྱས་ལ་ཤིན་ཏུ་དགའ་བར་གྱུར་ཏོ། །
en: and when he heard about them, the young brahmin experienced a surge of joy toward the Buddha.

source: དགའ་བར་གྱུར་ནས་སྨྲས་པ། བདག་ཀྱང་ཁྱེད་ཀྱི་ནང་དུ་འཇུག་པར་བགྱིའོ། །བདག་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་སྐྱབས་སུ་མཆི་བར་བགྱིའོ། །
en: In his joy he said, “I will join your group, and I will take refuge in the Blessed Buddha, Dharma, and Saṅgha.”

source: དེ་ནས་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱི་བུ་དེ་རྣམས་ཀྱིས་བྲམ་ཟེའི་ཁྱེའུ་དེས་ཚིག་དེ་ལྟ་བུ་བརྗོད་པ་ཐོས་སོ། །
en: The sons of the householder Anāthapiṇḍada heard what he said,

source: ཐོས་ནས་ཀྱང་དེ་རྣམས་ཀྱིས་དེ་ལ་ཀཱར་ཥཱ་པ་ཎ་བརྒྱ་ཕྲག་དུ་མ་བྱིན་ནོ། །
en: and gave him hundreds upon hundreds of gold coins.

source: བྲམ་ཟེའི་ཁྱེའུ་དེ་ཡང་དེ་རྣམས་ཀྱི་ནང་དུ་ཞུགས་སོ། །
en: In this way the young brahmin joined the group.

source: དེ་ནས་ཕྱི་ཞིག་ན་མཛའ་སྡེ་བོ་དེ་རྣམས་ཀྱི་བློ་སྐྱེས་པ།
en: One day the social club decided,

source: སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཟླ་བ་གསུམ་གྱི་བར་དུ་སྤྱན་དྲངས་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱའོ་ཞེས་ཟེར་རོ། །
en: “Let’s invite the Buddha and the rest of the saṅgha of monks and respectfully serve all their needs for three months.”

source: དེའི་ནང་ན་ཁ་ཅིག་ན་རེ་བདག་ཅག་ཀུན་གྱིས་ཟླ་བ་གསུམ་ཐོག་ཐག་ཏུ་དེ་འབའ་ཞིག་བྱེད་ཅིང་འདུག་མི་ནུས་ཀྱི།
en: Some replied, “We won’t all be able to do just that continuously for three months.

source: ཉིན་རེས་ཀྱིས་བཤོས་གསོལ་བར་བྱའོ་ཞེས་ཟེར་རོ། །
en: So let’s take turns offering them food each day.”

source: བྲམ་ཟེའི་ཁྱེའུས་སྨྲས་པ། བདག་ནི་དབུལ་ལ་འཚོ་བས་ཕོངས་ཏེ།
en: “I am destitute of means,” the brahmin said.

source: ཉིན་རེས་གཟུང་བ་དེ་ལྟ་བུ་བདག་གིས་མི་ནུས་སོ་ཞེས་ཟེར་རོ། །
en: “I won’t be able to do that for even a day.”

source: དེར་ཁ་ཅིག་ན་རེ་སུ་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་བཤོས་གསོལ་མི་ནུས་པ་དེ་ནི། བདག་ཅག་གི་ནང་ནས་གུད་དུ་བྱུང་ཅིག་ཅེས་ཟེར་རོ། །
en: “Those who aren’t able to offer food to the Buddha and the rest of the saṅgha of monks should part company with us,” the others replied.

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུས་བསམས་པ།
en: The young brahmin thought,

source: བདག་གི་འདི་རྣམས་ཀྱི་ནང་དུ་དེའུ་མ་ཆུད་དེ་ཆུད་ན། བདག་འདི་རྣམས་ཀྱི་ནང་ནས་འབྱུང་བ་ནི་ཆ་མ་ཡིན་ནོ་སྙམ་ནས་
en: “Whether or not I remain a member later, it would not be right for me to part ways with them right now.”

source: སྨྲས་པ། བདག་གིས་ཉིན་རེས་མཇུག་ཏུ་གྱིས་ལ།
en: He said, “I will take my turn on the final day.

source: ཁྱོད་ཀྱི་ལྷག་རོལ་ཅི་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བདག་ལ་བྱིན་ཅིག །
en: In the meantime, please give to me all your leftovers.”

source: མཛའ་སྡེ་བོ་རྣམས་ཀྱིས་སྨྲས་པ། ཁྱོད་ཅི་ལྟར་དགའ་བ་དེ་བཞིན་དུ་བྱའོ་ཞེས་བྱས་ནས།
en: “As you wish,” the social club members replied.

source: དེ་རྣམས་ཀྱིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཟླ་བ་གསུམ་གྱི་བར་དུ་སྤྱན་དྲངས་ནས། ཉིན་རེས་ཀྱིས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་ཟླ་བ་གསུམ་གྱི་བར་དུ་བསྙེན་བཀུར་བྱས་སོ། །
en: They extended an invitation to the Buddha and the rest of the saṅgha of monks for three months, and for three months each of them took turns respectfully serving the Buddha and the rest of the saṅgha of monks with everything they needed.

source: དེར་དེ་དག་གི་ལྷག་རོལ་ཅི་ཡོད་པ་དེ་དག་ཐམས་ཅད་བྲམ་ཟེའི་ཁྱེའུ་དེ་ལ་བྱིན་ནས།
en: Whatever was left over they gave to the young brahmin.

source: བྲམ་ཟེའི་ཁྱེའུས་དེ་དག་ཐམས་ཅད་བསྡུས་ཏེ། གཞན་དག་ཀྱང་ཀཱར་ཥཱ་པ་ཎ་གཞན་དག་འབུལ་དུ་བཅུག་ནས།
en: The young brahmin gathered it all together and led others to offer some gold coins,

source: ཐ་མའི་ཉིན་པར་དེས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཁྱིམ་དུ་སྤྱན་དྲངས་ཏེ། རྒྱལ་པོ་གསལ་རྒྱལ་དང་། ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་ལ་ཡང་བསྐུལ་ནས།
en: until on the last day he invited the Buddha and the rest of the saṅgha of monks to his house, along with King Prasenajit and the householder Anāthapiṇḍada.

source: དེས་དེ་ཉིད་ཀྱི་མཚན་མོ་ལམ་ཡང་མཛེས་པར་བྱས། གྲོང་ཁྱེར་ཡང་མཛེས་པར་བྱས་ནས། དེ་ཉིད་ཀྱི་མཚན་མོ་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོ་སྦྱར་རོ། །
en: That night, after beautifying the streets and beautifying the city, he prepared many good, wholesome foods, and in the morning he rose, prepared seats, filled the water pots, and set them out.

source: ནང་པར་སྔར་ལངས་ནས་གདན་བཤམས་ཏེ། ཆུ་ར་བཀང་ནས་བཅོམ་ལྡན་འདས་ལ་ཕྲིན་གྱིས་གདུགས་ཚོད་བསྐུལ་བ།
en: Then he sent a message to the Blessed One reminding him it was time for the midday meal:

source: བཙུན་པ་གདུགས་ཚོད་ལ་བབ་སྟེ་བཤོས་ལགས་ན།
en: “Lord, the midday meal is upon us.

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོ་ཤམ་ཐབས་དང་ཆོས་གོས་གསོལ་ཏེ། ལྷུང་བཟེད་བསྣམས་ནས། དགེ་སློང་མང་པོས་ཞབས་འབྲིང་བྱས་ཏེ། དགེ་སློང་གི་དགེ་འདུན་གྱིས་མདུན་དུ་བདར་ནས།
en: In the morning, the Blessed One donned his lower garment and Dharma robes, and, carrying his alms bowl, set out surrounded and attended by an assembly of monks.

source: བྲམ་ཟེའི་ཁྱེའུ་དེའི་བཀད་ས་ག་ལ་བ་དེར་གཤེགས་ཏེ་ཕྱིན་ནས། དགེ་སློང་གི་དགེ་འདུན་གྱི་གུང་ལ་གདན་བཤམས་པ་ལ་བཞུགས་སོ། །
en: When he arrived at the young brahmins’ reception room, he took his place on the seat prepared for him amid the saṅgha of monks.

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་དེས་སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་རྣམས་བདེ་བར་བཞུགས་པར་རིག་ནས། རང་གི་ལག་ནས་བཟའ་བ་དང་བཅའ་བ་གཙང་མ་བཟང་པོ་མང་པོས་ཚིམ་པར་བྱས་ཏེ། ཅི་བཞེད་པ་བསྟབས་ནས། བཅོམ་ལྡན་འདས་ལ་ཆེ་བ་ལ་འོས་པའི་ན་བཟའ་ཕུལ་ལོ། །
en: Once the young brahmin knew that the Buddha and the rest of the saṅgha of monks were comfortably seated, by his own hand he contented them with many good, wholesome foods, proffering all that they wished, and offered the finest clothing to the Blessed One.

source: དགེ་སློང་གཞན་དག་ལ་ཡང་རེ་རེ་ལ་རས་ཟུང་རེ་ཕུལ་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་པ།
en: After that he also offered each of the other monks a set of robes fashioned from cotton, and he prayed for unexcelled, total, and complete enlightenment, saying,
